ronakghodasara/MATLAB_MODEL_BASED_DESIGN/STM32F4/Simple_Switch/Push_Button_mode_ert_rtw/Push_Button_mode.h
/*
 * File: Push_Button_mode.h
 *
 * Code generated for Simulink model 'Push_Button_mode'.
 *
 * Model version                  : 1.11
 * Simulink Coder version         : 8.9 (R2015b) 13-Aug-2015
 * C/C++ source code generated on : Sun May 14 15:54:56 2017
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: ARM Compatible->ARM Cortex
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#ifndef RTW_HEADER_Push_Button_mode_h_
#define RTW_HEADER_Push_Button_mode_h_
#include <stddef.h>
#include <string.h>
#ifndef Push_Button_mode_COMMON_INCLUDES_
# define Push_Button_mode_COMMON_INCLUDES_
#include "rtwtypes.h"
#include "stm32f4discovery_wrapper.h"
#endif                                 /* Push_Button_mode_COMMON_INCLUDES_ */

#include "Push_Button_mode_types.h"
#include "MW_target_hardware_resources.h"

/* Macros for accessing real-time model data structure */
#ifndef rtmGetErrorStatus
# define rtmGetErrorStatus(rtm)        ((rtm)->errorStatus)
#endif

#ifndef rtmSetErrorStatus
# define rtmSetErrorStatus(rtm, val)   ((rtm)->errorStatus = (val))
#endif

/* Block states (auto storage) for system '<Root>' */
typedef struct {
  uint8_T Delay_DSTATE;                /* '<Root>/Delay' */
} DW_Push_Button_mode_T;

/* Parameters (auto storage) */
struct P_Push_Button_mode_T_ {
  uint32_T Delay_DelayLength;          /* Computed Parameter: Delay_DelayLength
                                        * Referenced by: '<Root>/Delay'
                                        */
  uint8_T Delay_InitialCondition;      /* Computed Parameter: Delay_InitialCondition
                                        * Referenced by: '<Root>/Delay'
                                        */
  uint8_T DataStoreMemory_InitialValue;/* Computed Parameter: DataStoreMemory_InitialValue
                                        * Referenced by: '<Root>/Data Store Memory'
                                        */
};

/* Real-time Model Data Structure */
struct tag_RTM_Push_Button_mode_T {
  const char_T *errorStatus;
};

/* Block parameters (auto storage) */
extern P_Push_Button_mode_T Push_Button_mode_P;

/* Block states (auto storage) */
extern DW_Push_Button_mode_T Push_Button_mode_DW;

/*
 * Exported States
 *
 * Note: Exported states are block states with an exported global
 * storage class designation.  Code generation will declare the memory for these
 * states and exports their symbols.
 *
 */
extern uint8_T Button_Press_Count;     /* '<Root>/Data Store Memory' */

/* Model entry point functions */
extern void Push_Button_mode_initialize(void);
extern void Push_Button_mode_step(void);
extern void Push_Button_mode_terminate(void);

/* Real-time Model object */
extern RT_MODEL_Push_Button_mode_T *const Push_Button_mode_M;

/*-
 * The generated code includes comments that allow you to trace directly
 * back to the appropriate location in the model.  The basic format
 * is <system>/block_name, where system is the system number (uniquely
 * assigned by Simulink) and block_name is the name of the block.
 *
 * Use the MATLAB hilite_system command to trace the generated code back
 * to the model.  For example,
 *
 * hilite_system('<S3>')    - opens system 3
 * hilite_system('<S3>/Kp') - opens and selects block Kp which resides in S3
 *
 * Here is the system hierarchy for this model
 *
 * '<Root>' : 'Push_Button_mode'
 * '<S1>'   : 'Push_Button_mode/MATLAB Function'
 */
#endif                                 /* RTW_HEADER_Push_Button_mode_h_ */

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
